/*
 * Copyright 1996-2004 by Hans Reiser, licensing governed by
 * reiserfsprogs/README
 */

/*
 *  Reiser File System constants and structures
 */

/* in reading the #defines, it may help to understand that they employ the
   following abbreviations:

   B = Buffer
   I = Item header
   H = Height within the tree (should be changed to LEV)
   N = Number of the item in the node
   STAT = stat data
   DEH = Directory Entry Header
   EC = Entry Count
   E = Entry number
   UL = Unsigned Long
   BLKH = BLocK Header
   UNFM = UNForMatted node
   DC = Disk Child
   P = Path

   These #defines are named by concatenating these abbreviations, where first
   comes the arguments, and last comes the return value, of the macro.

*/

#ifndef REISERFSPROGS_FS_H
#define REISERFSPROGS_FS_H

#include <linux/types.h>
#include "swab.h"

typedef __u16 __bitwise __le16;
typedef __u32 __bitwise __le32;
typedef __u64 __bitwise __le64;

typedef unsigned int blocknr_t;

#ifndef get_unaligned
#define get_unaligned(ptr)				\
({							\
        __typeof__(*(ptr)) __tmp;			\
        memcpy(&__tmp, (ptr), sizeof(*(ptr)));		\
        __tmp;						\
})
#endif

#ifndef put_unaligned
#define put_unaligned(val, ptr)				\
({							\
        __typeof__(*(ptr)) __tmp = (val);		\
        memcpy((ptr), &__tmp, sizeof(*(ptr)));		\
        (void)0;					\
})
#endif

#define get_leXX(xx,p,field)	(le##xx##_to_cpu ((p)->field))
#define set_leXX(xx,p,field,val) do { (p)->field = cpu_to_le##xx(val); } while (0)

#define get_le16(p,field)	get_leXX (16, p, field)
#define set_le16(p,field,val)	set_leXX (16, p, field, val)

#define get_le32(p,field)	get_leXX (32, p, field)
#define set_le32(p,field,val)	set_leXX (32, p, field, val)

#define get_le64(p,field)	get_leXX (64, p, field)
#define set_le64(p,field,val)	set_leXX (64, p, field, val)

/***************************************************************************/
/*                             SUPER BLOCK                                 */
/***************************************************************************/

#define UNSET_HASH 0		// read_super will guess about, what hash names
		     // in directories were sorted with
#define TEA_HASH  1
#define YURA_HASH 2
#define R5_HASH   3
#define DEFAULT_HASH R5_HASH

/* super block of prejournalled version */
struct reiserfs_super_block_v0 {
	__le32 s_block_count;
	__le32 s_free_blocks;
	__le32 s_root_block;
	__le16 s_blocksize;
	__le16 s_oid_maxsize;
	__le16 s_oid_cursize;
	__le16 s_state;
	char s_magic[16];
	__le16 s_tree_height;
	__le16 s_bmap_nr;
	__le16 s_reserved;
};

struct journal_params {
	__le32 jp_journal_1st_block;	/* where does journal start from on its
					   device */
	__le32 jp_journal_dev;	/* journal device st_rdev */
	__le32 jp_journal_size;	/* size of the journal on FS creation. used to
				   make sure they don't overflow it */
	__le32 jp_journal_trans_max;	/* max number of blocks in a transaction.  */
	__le32 jp_journal_magic;	/* random value made on fs creation (this was
				   sb_journal_block_count) */
	__le32 jp_journal_max_batch;	/* max number of blocks to batch into a trans */
	__le32 jp_journal_max_commit_age;	/* in seconds, how old can an async commit be */
	__le32 jp_journal_max_trans_age;	/* in seconds, how old can a transaction be */
};

#define get_jp_journal_1st_block(jp)	 get_le32 (jp, jp_journal_1st_block)
#define set_jp_journal_1st_block(jp,val) set_le32 (jp, jp_journal_1st_block, val)

#define get_jp_journal_dev(jp)		get_le32 (jp, jp_journal_dev)
#define set_jp_journal_dev(jp,val)	set_le32 (jp, jp_journal_dev, val)

#define get_jp_journal_size(jp)		get_le32 (jp, jp_journal_size)
#define set_jp_journal_size(jp,val)	set_le32 (jp, jp_journal_size, val)

#define get_jp_journal_max_trans_len(jp)	get_le32 (jp, jp_journal_trans_max)
#define set_jp_journal_max_trans_len(jp,val)	set_le32 (jp, jp_journal_trans_max, val)

#define get_jp_journal_magic(jp)	get_le32 (jp, jp_journal_magic)
#define set_jp_journal_magic(jp,val)	set_le32 (jp, jp_journal_magic, val)

#define NEED_TUNE 0xffffffff

#define get_jp_journal_max_batch(jp)	get_le32 (jp, jp_journal_max_batch)
#define set_jp_journal_max_batch(jp,val)	set_le32 (jp, jp_journal_max_batch, val)

#define get_jp_journal_max_commit_age(jp)	get_le32 (jp, jp_journal_max_commit_age)
#define set_jp_journal_max_commit_age(jp,val)	set_le32 (jp, jp_journal_max_commit_age, val)

#define get_jp_journal_max_trans_age(jp)	get_le32 (jp, jp_journal_max_commit_age)
#define set_jp_journal_max_trans_age(jp,val)	set_le32 (jp, jp_journal_max_commit_age, val)

/* this is the super from 3.5.X */
struct reiserfs_super_block_v1 {
	__le32 sb_block_count;	/* 0 number of block on data device */
	__le32 sb_free_blocks;	/* 4 free blocks count */
	__le32 sb_root_block;	/* 8 root of the tree */

	struct journal_params sb_journal;	/* 12 */

	__le16 sb_blocksize;	/* 44 */
	__le16 sb_oid_maxsize;	/* 46 max size of object id array, see
				   get_objectid() commentary */
	__le16 sb_oid_cursize;	/* 48 current size of object id array */
	__le16 sb_umount_state;	/* 50 this is set to 1 when filesystem was
				   umounted, to 2 - when not */

	char s_magic[10];	/* 52 reiserfs magic string indicates that
				   file system is reiserfs: "ReIsErFs" or
				   "ReIsEr2Fs" or "ReIsEr3Fs" */
	__le16 sb_fs_state;	/* 62 it is set to used by fsck to mark which phase of
				   rebuilding is done (used for fsck debugging) */
	__le32 sb_hash_function_code;	/* 64 code of fuction which was/is/will be
					   used to sort names in a directory. See
					   codes in above */
	__le16 sb_tree_height;	/* 68 height of filesytem tree. Tree
				   consisting of only one root block has 2
				   here */
	__le16 sb_bmap_nr;	/* 70 amount of bitmap blocks needed to
				   address each block of file system */
	__le16 sb_version;	/* 72 this field is only reliable on
				   filesystem with non-standard journal */
	__le16 sb_reserved_for_journal;	/* 74 size in blocks of journal area on
					   main device, we need to keep after
					   non-standard journal relocation */
};

#define SB_SIZE_V1 (sizeof(struct reiserfs_super_block_v1))	/* 76 bytes */

#define sb_jp(sb) (&((sb)->s_v1.sb_journal))

/* values for sb_version field of struct reiserfs_super_block. sb_version is
   only reliable on filesystem with non-standard journal */
#define REISERFS_FORMAT_3_5 0
#define REISERFS_FORMAT_3_6 2
#define REISERFS_FORMAT_UNKNOWN -1

/* values for sb_mount_state field */
#define FS_CLEANLY_UMOUNTED    1	/* this was REISERFS_VALID_FS */
#define FS_NOT_CLEANLY_UMOUNTED    2	/* this was REISERFS_ERROR. It
					   means that filesystem was not
					   cleanly unmounted */

/* Structure of super block on disk */
struct reiserfs_super_block {
/*  0 */ struct reiserfs_super_block_v1 s_v1;
/* 76 */ __le32 sb_inode_generation;
				/* 80 */ __le32 s_flags;
				/* Right now used only by inode-attributes, if enabled */
						/* 84 */ unsigned char s_uuid[16];
						/* filesystem unique identifier */
					/*100 */ char s_label[16];
					/* filesystem volume label */
/*116 */ __le16 s_mnt_count;
/*118 */ __le16 s_max_mnt_count;
/*120 */ __le32 s_lastcheck;
/*124 */ __le32 s_check_interval;
					/*128 */ char s_unused[76];
					/* zero filled by mkreiserfs and reiserfs_convert_objectid_map_v1()
					 * so any additions must be updated there as well. */
/*204*/
} __attribute__ ((__packed__));;

typedef enum {
	reiserfs_attrs_cleared = 0x00000001,
} reiserfs_super_block_flags;

#define SB_SIZE (sizeof(struct reiserfs_super_block))	/* 204 bytes */

/* set/get fields of super block with these defines */
#define get_sb_block_count(sb)		get_le32 (sb, s_v1.sb_block_count)
#define set_sb_block_count(sb,val)	set_le32 (sb, s_v1.sb_block_count, val)

#define get_sb_free_blocks(sb)		get_le32 (sb, s_v1.sb_free_blocks)
#define set_sb_free_blocks(sb,val)	set_le32 (sb, s_v1.sb_free_blocks, val)

#define get_sb_root_block(sb)		get_le32 (sb,s_v1.sb_root_block)
#define set_sb_root_block(sb,val)	set_le32 (sb, s_v1.sb_root_block, val)

#if 0
#define get_sb_mount_id(sb)		get_le32 (sb,s_v1.sb_mountid)
#define set_sb_mount_id(sb,val)		set_le32 (sb, s_v1.sb_mountid, val)

